spec/vcr/dwolla_mass_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://uat.dwolla.com/oauth/v2/token
    body:
      encoding: UTF-8
      string: grant_type=refresh_token&refresh_token=ikyoqz7GYb0xaY9pQT8t550kSu4xmSrUil752xLiBLX6HAk0HA
    headers:
      User-Agent:
      - dwolla-v2-ruby 1.1.2
      Authorization:
      - Basic dzREdkNHckFLYWFsMEM2Qk50cHRtbmpiSFBJUU1ZT2VnMldib3dkWU9GY1I3T0hqVk46TmhsQ3JzSGl0MlZZaHF3Q2dmR09nWWRnd2ZhUVh2NHV4TkhxdHBvNW5pYU5oOVpFUHU=
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 Dec 2017 18:35:21 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d8d1e5fb57709978540cbd50a9c31c14e1514313320; expires=Wed, 26-Dec-18
        18:35:20 GMT; path=/; domain=.dwolla.com; HttpOnly
      - dtid=9817f8d0-abb5-42b2-9f19-0d7bcd83612b; expires=Sun, 26-Dec-2027 18:35:08
        GMT; path=/; HttpOnly
      Cache-Control:
      - private
      P3p:
      - CP="CAO PSA OUR"
      Strict-Transport-Security:
      - max-age=31536000
      X-Aspnetmvc-Version:
      - '4.0'
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 3d3623addded22d0-LAX
    body:
      encoding: ASCII-8BIT
      string: '{"_links":{"account":{"href":"https://api-sandbox.dwolla.com/accounts/1ba9585f-6468-4d1e-844a-4a13fea0d605"}},"access_token":"XYvz6hq18mLd8qaWUy621iViKYhepXKWgfvbdDsOJFKPMdOTtR","expires_in":3613,"refresh_token":"I3sYBplB2Z6r0E5s9XpsYMkbMMjixkskqSYgWnXLp15Z5zlNr1","refresh_expires_in":5184013,"token_type":"bearer","scope":"accountinfofull|email|transactions|send|funding","account_id":"1ba9585f-6468-4d1e-844a-4a13fea0d605"}'
    http_version: 
  recorded_at: Tue, 26 Dec 2017 18:35:21 GMT
- request:
    method: post
    uri: https://api-uat.dwolla.com/mass-payments
    body:
      encoding: UTF-8
      string: '{"_links":{"source":{"href":"https://api-uat.dwolla.com/funding-sources/0b6f1c75-dd43-4495-b9bb-17387dafb553"}},"items":[{"_links":{"destination":{"href":"https://api-uat.dwolla.com/accounts/092499dc-d0f0-45c9-b89e-c42d050cbb21"}},"amount":{"currency":"USD","value":"45.00"},"metadata":{"auth_uid":"092499dc-d0f0-45c9-b89e-c42d050cbb21","payee_id":1,"approver_id":5,"description":"Payment
        for invoices: 1, 2."}}]}'
    headers:
      Authorization:
      - Bearer XYvz6hq18mLd8qaWUy621iViKYhepXKWgfvbdDsOJFKPMdOTtR
      Accept:
      - application/vnd.dwolla.v1.hal+json
      User-Agent:
      - dwolla-v2-ruby 1.1.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 26 Dec 2017 18:35:21 GMT
      Content-Type:
      - application/vnd.dwolla.v1.hal+json
      Content-Length:
      - '0'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d69107d13579fb35cf87026ef478a05e31514313321; expires=Wed, 26-Dec-18
        18:35:21 GMT; path=/; domain=.dwolla.com; HttpOnly
      Location:
      - https://api-uat.dwolla.com/mass-payments/c5a85d6e-f315-4fd4-b5d5-a85501324943
      X-Request-Id:
      - 77bd665c-ed7e-444b-b22f-17e041c0f7d5
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 3d3623b3fe617754-LAX
    body:
      encoding: UTF-8
      string: ''
    http_version: 
  recorded_at: Tue, 26 Dec 2017 18:35:22 GMT
- request:
    method: post
    uri: https://uat.dwolla.com/oauth/v2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials
    headers:
      User-Agent:
      - dwolla-v2-ruby 1.1.2
      Authorization:
      - Basic dzREdkNHckFLYWFsMEM2Qk50cHRtbmpiSFBJUU1ZT2VnMldib3dkWU9GY1I3T0hqVk46TmhsQ3JzSGl0MlZZaHF3Q2dmR09nWWRnd2ZhUVh2NHV4TkhxdHBvNW5pYU5oOVpFUHU=
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 Dec 2017 18:35:22 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d5f39594d6363b7f83208141cb6af6ac91514313322; expires=Wed, 26-Dec-18
        18:35:22 GMT; path=/; domain=.dwolla.com; HttpOnly
      - dtid=7836fb70-951c-4887-b719-53325d02c83f; expires=Sun, 26-Dec-2027 18:35:20
        GMT; path=/; HttpOnly
      Cache-Control:
      - private
      P3p:
      - CP="CAO PSA OUR"
      Strict-Transport-Security:
      - max-age=31536000
      X-Aspnetmvc-Version:
      - '4.0'
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 3d3623b7ae0e229a-LAX
    body:
      encoding: ASCII-8BIT
      string: '{"access_token":"MB9jYBaPq0caAyc5hlk2OiuS3Ux4cjBhRsAlywt9tgV5Y9cHbz","token_type":"bearer","expires_in":3601}'
    http_version: 
  recorded_at: Tue, 26 Dec 2017 18:35:22 GMT
- request:
    method: get
    uri: https://api-uat.dwolla.com/mass-payments/c5a85d6e-f315-4fd4-b5d5-a85501324943/items
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - Bearer MB9jYBaPq0caAyc5hlk2OiuS3Ux4cjBhRsAlywt9tgV5Y9cHbz
      Accept:
      - application/vnd.dwolla.v1.hal+json
      User-Agent:
      - dwolla-v2-ruby 1.1.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 Dec 2017 18:35:23 GMT
      Content-Type:
      - application/vnd.dwolla.v1.hal+json
      Content-Length:
      - '1586'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d65f66422fcb32da24ba4689d0a25830d1514313323; expires=Wed, 26-Dec-18
        18:35:23 GMT; path=/; domain=.dwolla.com; HttpOnly
      X-Request-Id:
      - 6bf1db18-3888-4c55-ae43-e040513a6d66
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 3d3623bcde237760-LAX
    body:
      encoding: UTF-8
      string: '{"_links":{"self":{"href":"https://api-uat.dwolla.com/mass-payments/c5a85d6e-f315-4fd4-b5d5-a85501324943/items","type":"application/vnd.dwolla.v1.hal+json","resource-type":"mass-payment-item"},"first":{"href":"https://api-uat.dwolla.com/mass-payments/c5a85d6e-f315-4fd4-b5d5-a85501324943/items?&limit=25&offset=0","type":"application/vnd.dwolla.v1.hal+json","resource-type":"mass-payment-item"},"last":{"href":"https://api-uat.dwolla.com/mass-payments/c5a85d6e-f315-4fd4-b5d5-a85501324943/items?&limit=25&offset=0","type":"application/vnd.dwolla.v1.hal+json","resource-type":"mass-payment-item"}},"_embedded":{"items":[{"_links":{"self":{"href":"https://api-uat.dwolla.com/mass-payment-items/48b81223-9a84-4d66-adae-c8e0a9ee79b4","type":"application/vnd.dwolla.v1.hal+json","resource-type":"mass-payment-item"},"mass-payment":{"href":"https://api-uat.dwolla.com/mass-payments/c5a85d6e-f315-4fd4-b5d5-a85501324943","type":"application/vnd.dwolla.v1.hal+json","resource-type":"mass-payment"},"destination":{"href":"https://api-uat.dwolla.com/accounts/092499dc-d0f0-45c9-b89e-c42d050cbb21","type":"application/vnd.dwolla.v1.hal+json","resource-type":"account"},"transfer":{"href":"https://api-uat.dwolla.com/transfers/f81e6f8a-6bea-e711-8103-0a595ef38714","type":"application/vnd.dwolla.v1.hal+json","resource-type":"transfer"}},"id":"48b81223-9a84-4d66-adae-c8e0a9ee79b4","status":"success","amount":{"value":"45.00","currency":"USD"},"metadata":{"auth_uid":"092499dc-d0f0-45c9-b89e-c42d050cbb21","approver_id":"5","description":"Payment
        for invoices: 1, 2.","payee_id":"1"}}]},"total":1}'
    http_version: 
  recorded_at: Tue, 26 Dec 2017 18:35:23 GMT
recorded_with: VCR 3.0.3
